{"id": "chim", "desc": " "},
{"id": "chlo", "desc": "Goddess of flowers and spring, Chloris brought life to the world—only to be overshadowed by gods who claimed the credit."},
{"id": "chro", "desc": " "},
{"id": "circ", "desc": "Men came to Circe’s island expecting to conquer, but she turned them into swine instead—because power, in the end, belongs to those who take it."},
{"id": "clst", "desc": " "},
{"id": "coeus", "desc": "A god of knowledge and foresight, Coeus saw the fall of the Titans coming—but wisdom meant nothing when faced with raw power."},
{"id": "crns", "desc": " "},
{"id": "daed", "desc": " "},
{"id": "daph", "desc": "Chased by Apollo with no escape in sight, Daphne chose transformation over surrender—becoming a laurel tree rather than his prize."},
{"id": "dmtr", "desc": "Goddess of the harvest, Demeter fed the world—until her daughter was stolen, and she let the earth starve in her grief."},
{"id": "dyns", "desc": "God of wine, revelry, and divine chaos, Dionysus offered pleasure without limits—until the party ended, and the reckoning began."},
{"id": "echo", "desc": "Cursed to repeat only the words of others, Echo faded into nothing—a warning that sometimes, love doesn’t just break your heart, it erases you."},
{"id": "eile", "desc": "Goddess of childbirth, Eileithyia held the power of life itself—deciding who entered the world and how much they would suffer for it."},
{"id": "emp", "desc": "A blood-drinking demon with a taste for travelers, Empusa lured men in with beauty—then devoured them whole."},
{"id": "eos",  "desc": "Goddess of the dawn, Eos ushered in the light but was cursed with endless desire—always chasing love, yet never keeping it."},
{"id": "erbs", "desc": "The very embodiment of darkness, Erebus existed before the world began—proof that night comes first, and light is only temporary."},
{"id": "eris", "desc": "Goddess of strife, Eris didn’t start wars—she just tossed the first spark and watched as mortals and gods tore themselves apart."},
{"id": "eros", "desc": "More than just love, Eros was raw passion—irresistible, irrational, and capable of making gods and mortals alike destroy themselves in pursuit of it."},
{"id": "gaia", "desc": "Born from nothing, Gaia made the world—but for every life she gave, she demanded vengeance on those who betrayed her."},
{"id": "gany", "desc": " "},
{"id": "hdes", "desc": " "},
{"id": "hcte", "desc": " "},
{"id": "hels", "desc": " "},
{"id": "heph", "desc": "The gods mocked him, his wife betrayed him, but Hephaestus forged wonders none could match—turning rejection into power, one masterpiece at a time."},
{"id": "hera", "desc": " "},
{"id": "herc", "desc": " "},
{"id": "hipp", "desc": " "},
{"id": "hrms", "desc": "Messenger, trickster, and guide of souls, Hermes moved between worlds with a smirk—because when you’re faster than fate, rules are just suggestions."},
{"id": "hsta", "desc": "Goddess of the hearth and home, Hestia kept Olympus burning—quietly, patiently, and without demanding the worship given to lesser gods."},
{"id": "hypn", "desc": " "},
{"id": "hypns", "desc": "" },
{"id": "iaps", "desc": "A Titan of mortality and father of Prometheus, Iapetus shaped the destiny of mankind—before being swallowed by the very history he helped create."},
{"id": "icar", "desc": " "},
{"id": "iris", "desc": "Goddess of the rainbow and divine herald, Iris carried the gods’ words with grace—always in motion, yet never truly seen."},
{"id": "jsn", "desc": " "},
{"id": "lael", "desc": "A hunting dog destined to catch whatever it chased—until it was set against a prey that could never be caught, forcing the gods to turn them both to stone."},
{"id": "nems", "desc": "Goddess of vengeance, Nemesis ensured no one—mortal or god—escaped the consequences of their arrogance."},
{"id": "nike", "desc": "Winged goddess of triumph, Nike never lost—but unlike the warriors she favored, she never needed to fight."},
{"id": "nyx", "desc": "Born before the gods, Nyx was the embodiment of night itself—so powerful that even Zeus dared not cross her."},
{"id": "ocns", "desc": "The great river encircling the world, Oceanus ruled the waters before Poseidon—until time and myth pushed him beyond the horizon."},
{"id": "pan", "desc": " "},
{"id": "phne", "desc": " "},
{"id": "phd", "desc": "Born of war itself, Phobos and Deimos followed Ares into battle—not as warriors, but as the panic and dread that struck before the first blow."},
{"id": "phbe", "desc": " "},
{"id": "pity", "desc": " "},
{"id": "psdn", "desc": " "},
{"id": "psyc", "desc": " "},
{"id": "prmt", "desc": " "},
{"id": "prps", "desc": " "},
{"id": "prss", "desc": " "},
{"id": "rhea", "desc": " "},
{"id": "seln", "desc": " "},
{"id": "syrx", "desc": " "},
{"id": "teth", "desc": " "},
{"id": "thnts", "desc": " "},
{"id": "thea", "desc": " "},
{"id": "thes", "desc": " "},
{"id": "trtn", "desc": " "},
{"id": "trph", "desc": " "},
{"id": "tych", "desc": " "},
{"id": "urns", "desc": " "},
{"id": "zeus", "desc": " "}
]