[
{"id": "aeth", "desc": "The very light of the heavens, Aether existed above all—untouchable, unshaken, and watching as the world burned below."},
{"id": "amph", "desc": "Married to Poseidon but never quite tamed, Amphitrite ruled the depths from the shadows—silent, unseen, and utterly unimpressed."},
{"id": "anke", "desc": "The silent hand of destiny, Ananke moves without pity or pause—neither gods nor mortals escape the fate she weaves."},
{"id": "anta", "desc": "Fueled by the earth itself, Antaeus was unstoppable—until Hercules lifted him off the ground and left him powerless."},
{"id": "aph", "desc": "More than just a goddess of love, Aphrodite was a master of manipulation—starting wars, ruining lives, and punishing anyone who dared resist her charm."},
{"id": "aplo", "desc": "God of the sun, prophecy, and plague, Apollo could inspire or destroy with equal ease—light and healing were his gifts, but so was merciless wrath."},
{"id": "ares", "desc": "God of war in its ugliest form, Ares lived for chaos and carnage—feared on the battlefield, but hated by gods and mortals alike."},
{"id": "arth", "desc": " "},
{"id": "arus", "desc": "God of bees, cheese, and forgotten arts, Aristaeus reaped nature’s bounty—until his recklessness cost him dearly, and he had to beg for redemption."},
{"id": "artm", "desc": "Goddess of the hunt and sworn to no one, Artemis protected the innocent and punished the foolish—especially men who didn’t take no for an answer."},
{"id": "astn", "desc": "A king, a monster, or just a story rewritten by the victors—Asterion remains a mystery, swallowed by myth and time."},
{"id": "asta", "desc": " "},
{"id": "asts", "desc": "A god of dusk and the winds, Astraeus gave the world its stars and seasons—only to be overshadowed by the gods who followed."},
{"id": "atha", "desc": "Goddess of wisdom and war, Athena rewarded strategy, not sentiment—just ask the heroes she helped and the cities she destroyed."},
{"id": "atlas", "desc": "Punished for a war he didn’t start, Atlas was condemned to hold up the sky—forever bearing the weight of a lost cause."},
{"id": "auxth", "desc": "Goddesses of the seasons, Auxo and Thallo made the world bloom and thrive—thanklessly, while mortals praised gods who did far less."},
